{
  "addOrUpdateEncouragement / if (request.getReasonId() !\u003d null \u0026\u0026 request.getType() !\u003d null \u0026\u0026 request.getType().getTypeId() !\u003d null)": [
    "**Business Process Description:**\n\nUpon receipt of a new encouragement registration request, the following process is triggered:\n\n1. **Initial Review**: The system retrieves the reason type associated with the given reason ID and type ID provided in the request.\n   If the reason ID exists, then:\n   - Proceed to step 2; otherwise,\n   - Return an error message indicating that the reason ID does not exist.\n\nThis process ensures that only valid and existing reasons can be registered for encouragement."
  ],
  "addOrUpdateEncouragement / if (!encouragedPerson.getPersonnelMembershipCode().equals(MembershipType.PERMANENT.getCode()))": [
    "Here is a clear business process description based on the provided Java method explanation:\n\n**Process Name:** Verify Official Status of Selected Individual\n\n**Trigger:** A user has selected an individual for encouragement registration.\n\n**Step 1: Check Official Status (If ... Then ... Otherwise ...)**\nIf the selected individual does not have an official status, then throw a ValidationException with the message \"The selected person is not officially recognized.\"\n\n**Decision Point:**\nIn this step, we verify whether the selected individual has an official status. If they do not meet this criteria, the process ends here.\n\n**Business Impact:** This exception ensures that only individuals with official recognition can be registered for encouragement.\n\nNote: I did not provide a detailed description of what \"official status\" means in this context, as it was not provided in the original code snippet."
  ],
  "addOrUpdateEncouragement / if (encouragement.getEncouragementStatus() \u003d\u003d null || encouragement.getEncouragementStatus().equals(EncouragementResultEnum.DRAFT.getCode()))": [
    "Here\u0027s a clear business process description:\n\n**Process Name:** Manage Encouragement Requests\n\n**Objective:** To review and manage encouragement requests submitted by employees or teams, ensuring that each request is properly evaluated and status updated accordingly.\n\n**Process Flow:**\n\n1. **Encouragement Request Submission**: An employee or team submits an encouragement request to the organization.\n2. If the request meets basic criteria (e.g., adheres to company policies), then:\n\t* The request is registered in the system, creating a new record for tracking and evaluation.\n3. Otherwise, if the request does not meet the criteria, then:\n\t* The request is rejected, and an automated notification is sent to the submitter indicating that the request was not accepted due to non-compliance with company policies.\n\n**Review and Evaluation:**\n\n1. Once a request is registered or accepted, it enters a review phase where designated personnel evaluate the encouragement request.\n2. Upon completion of the evaluation, if the request meets the necessary criteria, then:\n\t* The request status is updated to \"Approved\" or \"In Progress\", indicating that the organization will move forward with implementing the requested encouragement.\n3. Otherwise, if the request does not meet the necessary criteria, then:\n\t* The request status is updated to \"Rejected\", and an automated notification is sent to the submitter explaining the reason for rejection.\n\n**Ongoing Monitoring:**\n\n1. Throughout the process, ongoing monitoring and updates are essential to ensure that each encouragement request receives proper evaluation and status updating.\n2. Regular review of the encouragement requests helps identify trends, patterns, and areas for improvement, informing organizational decision-making.\n\nBy following this process, our organization can effectively manage encouragement requests, promote a positive work environment, and foster employee engagement and motivation."
  ],
  "addOrUpdateEncouragement / if (DraftEnum.fromCode(request.getEncouragementDraft()).equals(DraftEnum.Sent))": [
    "**Business Process Description:**\n\n**Process:** Register an Encouragement (Initial Stage)\n\n**Purpose:** To create a new encouragement and register its draft date for future review.\n\n**Flow:**\n\n1. **If** a user initiates the creation of a new encouragement, **then**:\n\t* The system sets the \"sent draft date\" for the encouragement to the current date.\n2. **Otherwise**, if an existing encouragement requires updates or modifications, the process is:\n\t* Update the status of the existing encouragement (e.g., from \"draft\" to \"in progress\").\n3. **In all cases**:\n\t* The system records the updated or new encouragement\u0027s draft date for future reference.\n\n**Key Decisions:**\n\n1. Determine whether a new encouragement needs to be created or an existing one requires updates.\n2. Set the sent draft date for the newly created or updated encouragement.\n\n**Actions:**\n\n1. Create a new encouragement and set its initial status to \"draft\".\n2. Update the status of the encouragement, if necessary.\n3. Record the update/draft date for future reference.\n\nThis business process description outlines the key steps involved in registering an encouragement, including setting the draft date. The flowchart illustrates the conditional decisions and actions taken throughout the process."
  ],
  "addOrUpdateEncouragement / if (!DraftEnum.fromCode(request.getEncouragementDraft()).equals(DraftEnum.Sent))": [
    "Here is a clear business process description based on the Java method explanation:\n\n**Create an Encouragement Process**\n\nWhen creating an encouragement, if the user has the necessary permissions and authorization, then they can initiate the creation of a new encouragement. Otherwise, they will not be able to proceed with the creation.\n\nUpon submission of the encouragement details, the system will set the initial status of the encouragement as \"Draft\". This indicates that the encouragement is still in its early stages and requires further development or review before it can be considered complete.\n\nIn this state, the user can choose to update the encouragement content, status, or other relevant information. If they decide to move forward with the encouragement, then they will need to review and finalize the content. If they are not satisfied with the current version, they may opt to delete the encouragement altogether, effectively rejecting it.\n\n**Key Steps:**\n\n1. User initiates creation of a new encouragement (IF authorized).\n2. System sets initial status as \"Draft\".\n3. User reviews and updates encouragement details as needed.\n4. User finalizes or rejects the encouragement (IF not satisfied).\n\nBy following this process, our organization can effectively manage the creation, review, and refinement of encouragements, ensuring that they meet our quality standards and are ready for distribution or sharing."
  ],
  "addOrUpdateEncouragement / else": [
    "Here is the translated business process description:\n\n**Validate Input Parameters**\n\nWhen an employee attempts to register or update an encouragement, the system checks if the input parameters are valid. If the parameters do not meet the expected format and criteria, then an error message is displayed indicating that the input is invalid.\n\n**Error Handling**\n\nIn this case, the system throws a \"General Exception\" with a message stating that the input parameters are not valid. This exception indicates that the process cannot proceed further due to incorrect or incomplete information.\n\nNo encouragement is created, updated, or removed in this scenario, as the system has identified an issue with the input data. The employee will need to review and correct their input before attempting to register or update an encouragement again.\n\n**Process Flow**\n\n1. Employee attempts to register or update an encouragement.\n2. System validates input parameters.\n3. If input parameters are invalid, throw a \"General Exception\" indicating the error.\n4. No further action is taken until the employee resolves the issue and re-attempts the registration or update process."
  ],
  "addOrUpdateEncouragement / if (encouragement.getEncouragementStatus() !\u003d null \u0026\u0026 !encouragement.getEncouragementStatus().equals(ReviewResultEnum.SENT_FOR_REGISTRAR_CORRECTION.getCode()))": [
    "Here is the business process description:\n\n**Process: Encouragement Status Update**\n\nThe process begins when an encouragement draft is received from a stakeholder. If the encouragement draft has not yet been sent, then:\n\n* The status of the encouragement remains in the \"Draft\" stage.\n* No further action is taken.\n\nHowever, if the encouragement draft has already been sent (i.e., it is no longer in the \"Draft\" stage), then:\n\n* If the encouragement\u0027s current status is still \"Draft\", update its status to \"Under Review\".\n* Additionally, record the date when the encouragement was sent.\n* The encouragement\u0027s status remains in the \"Under Review\" stage until further action is taken.\n\nIn summary, this process manages the status of an encouragement from draft to review and sent stages."
  ],
  "addOrUpdateEncouragement / if ((registrar.getPersonnelUnitCode() \u003d\u003d null || encouragedPerson.getPersonnelUnitCode() \u003d\u003d null) || Objects.equals(registrar.getPersonnelUnitCode(), encouragedPerson.getPersonnelUnitCode()))": [
    "Here is the business process description:\n\n**Process: Register an Encouragement**\n\nThe purpose of this process is to register an encouragement for a personnel member, ensuring that it is assigned to their correct manager and organization.\n\n**Step 1: Check Manager Affiliation**\n\nIf the encouraged person is affiliated with a manager who belongs to the same organization as the registrar, then proceed to the next step. Otherwise, throw an error indicating that the encouraged person is not part of the required organizational hierarchy.\n\n**Step 2: Create or Update Encouragement (if necessary)**\n\nCreate or update an encouragement record based on the provided request and reason type. Assign the encouragement to the registrar\u0027s organization ID.\n\n**Step 3: Determine Encouragement Status**\n\nIf the encouragement has a status, check if it is not already sent for registrar correction. If so, set the status to \"Draft\" unless the draft is already marked as \"Sent\", in which case:\n\n* Set the status to \"Under Review\"\n* Record the date the draft was sent\n\n**Step 4: Store Encouragement**\n\nAdd the created or updated encouragement record to the list of encouragements.\n\nIn summary, this process ensures that an encouragement is properly registered and assigned to a personnel member\u0027s manager, considering organizational affiliations and status updates."
  ],
  "addOrUpdateEncouragement / if (list.isEmpty())": [
    "Here is the business process description:\n\n**Process: Register and Manage Encouragements**\n\nThe goal of this process is to register an encouragement and manage its status throughout its lifecycle. The process involves multiple steps and decision points that ensure the encouragement is properly recorded, updated, or removed as needed.\n\n**Step 1: Request Registration**\nAn individual (requester) initiates the registration of a new encouragement by submitting a draft proposal. This triggers the creation of a new encouragement record.\n\n**If**: the request meets the required criteria and has been reviewed for completeness and accuracy, **then**:\n\n**Step 2: Register Encouragement**\nThe registered organization\u0027s registrar (responsible for managing encouragements) reviews and verifies the request. Upon approval, the encouragement is formally registered, creating a new record in the system.\n\n**Otherwise**: if the request does not meet the required criteria or has errors, **then**:\n\n**Step 3: Update/Reject Request**\nThe registrar will update the request to address any issues or reject it entirely if necessary. This step ensures that only valid and complete requests are registered.\n\n**Throughout the process**: the current user\u0027s role (currentUserRole) is tracked to ensure appropriate access controls and decision-making authority.\n\n**Step 4: Review/Update Status**\nOnce an encouragement is registered, its status can be updated by the registrar or other authorized users. This may involve reviewing and approving the proposal, updating the status to reflect changes in the project, or removing the encouragement if it no longer meets organizational goals.\n\n**If**: the encouragement\u0027s status requires additional information or updates, **then**:\n\n**Step 5: Request Update**\nThe registrar will request further information or updates from the requester before making any changes to the encouragement\u0027s status.\n\n**Otherwise**: if the encouragement\u0027s status is complete and up-to-date, **then**:\n\n**Step 6: Finalize Status**\nThe registrar finalizes the encouragement\u0027s status, ensuring that all necessary updates are recorded and reflected in the system.\n\nIn summary, this process enables the registration, management, and updating of encouragements within an organization. It involves multiple decision points, conditional logic, and CRUD operations (create, read, update, delete) to ensure accurate recording and tracking of these initiatives."
  ],
  "addOrUpdateEncouragement / if (encouragement.getEncouragementStatus().equals(ReviewResultEnum.SENT_FOR_REGISTRAR_CORRECTION.getCode()))": [
    "**Business Process Description:**\n\nThe Encouragement Registration Process is a critical function that enables the organization to review and manage employee encouragement submissions. The process commences when an employee submits an encouragement request.\n\n**Step 1: Initial Submission**\nWhen an employee submits an encouragement request, it is considered for initial processing. This step involves creating a new encouragement record with the relevant details provided by the employee (e.g., name, message).\n\n**If** the submission meets the minimum requirements and adheres to company guidelines, **then**:\n\n**Step 2: Review**\nThe encouragement request is reviewed by a designated team member to ensure it aligns with organizational values and goals. This review aims to assess the validity and relevance of the encouragement.\n\n**Otherwise**, if the submission does not meet the minimum requirements or violates company policies, **then**:\n\n**Step 3: Rejection**\nThe encouragement request is rejected, and an email notification is sent to the employee explaining the reasons for rejection.\n\n**Step 4: Ongoing Review (Under Review)**\nIf the encouragement request passes the initial review, it enters a status of \"Under Review.\" During this phase, the designated team member continues to assess the request against established criteria. This may involve gathering additional information or seeking feedback from other stakeholders.\n\nOnce the review process is complete, one of two outcomes occurs:\n\n**If** the encouragement request meets all requirements and aligns with organizational goals, **then**:\n\n**Step 5: Approval**\nThe encouragement request is approved, and a notification is sent to the employee acknowledging the outcome. The employee can now share their encouragement publicly or privately, as desired.\n\n**Otherwise**, if the review process identifies areas for improvement or concerns, **then**:\n\n**Step 6: Update/Re-Submission**\nThe employee is notified of the issues and invited to update their submission. This may involve making changes to address specific concerns or providing additional information.\n\nUltimately, this business process ensures that employee encouragement submissions are carefully reviewed, evaluated, and managed according to organizational standards and values."
  ],
  "addOrUpdateEncouragement / if (request.getEncouragementDraft() !\u003d null \u0026\u0026 request.getEncouragementDraft().equals(DraftEnum.Sent.getCode()))": [
    "**Business Process Description:**\n\nWhen a registrar organization receives an encouragement that has not been viewed, the following process occurs:\n\n1. **Initial Check**: The system checks if the encouragement has been reviewed by any ordinary reviewers (i.e., non-experts). If it hasn\u0027t, then...\n2. **Calculate and Register/Update**: The system calculates the encouragement\u0027s status and registration details using the provided data and the registrar organization ID, and registers or updates the encouragement accordingly.\n3. **Check for Correction Needed**: If the encouragement has been reviewed by ordinary reviewers and its status is either \"Sent for Registrar Correction\" or \"Needs Acceptance\", then...\n4. **Update Review Status**: The system updates the review\u0027s status to \"Approved\" and sets the sent draft date to the current date.\n5. **Update Encouragement Status**: If the encouragement was previously marked as \"Sent for Registrar Correction\", it is updated to \"Under Review\".\n6. **Mark As Viewed**: The system marks the encouragement as viewed by updating its corresponding flag.\n\n**Exceptions:**\n\nIf the encouragement has already been reviewed and its status indicates that it cannot be edited (i.e., it\u0027s already been accepted or rejected), an exception is thrown, indicating that the encouragement cannot be updated because it has been viewed."
  ],
  "addOrUpdateEncouragement / if (!resultList.isEmpty() \u0026\u0026 request.getEncouragementDraft().equals(DraftEnum.Sent.getCode()))": [
    "Here is a clear business process description:\n\n**Encouragement Review and Update Process**\n\nThis process handles the review and update of encouragements submitted by registrars. The process involves checking the status of the encouragement, reviewing any existing reviews, and updating the encouragement\u0027s status and visibility accordingly.\n\n**Step 1: Check Encouragement Status and Draft**\nIf a registrar submits an encouragement draft with the status \"Sent\", then proceed to the next step. Otherwise, stop processing.\n\n**Step 2: Review Existing Reviews (if applicable)**\nIf there are existing reviews for this encouragement, check if they have been seen by the registrar. If not, proceed to the next step. If yes, raise an exception indicating that the encouragement cannot be updated.\n\n**Step 3: Calculate and Update Encouragement Status (if applicable)**\nIf no existing reviews exist or all reviews have been seen, calculate the new status of the encouragement based on its current status and the registrar\u0027s role.\n\n* If the encouragement is \"Sent for Registrar Correction\", set its status to \"Under Review\".\n* Otherwise, update the encouragement\u0027s status accordingly.\n\n**Step 4: Mark Encouragement as Seen (if applicable)**\nIf the encouragement has been reviewed or updated, mark it as seen by the registrar."
  ],
  "addOrUpdateEncouragementByEncouragementSpecialist / if (dto.getReasonId() !\u003d null \u0026\u0026 dto.getType() !\u003d null \u0026\u0026 dto.getType().getTypeId() !\u003d null)": [
    "**Encouragement Reason Retrieval Process**\n\nThis business process retrieves an encouragement reason based on a provided ID and type. The process involves the following steps:\n\n1. **Initialization**: Receive a request to retrieve an encouragement reason, including an ID and a type.\n2. **Reason Type Identification**: If the provided ID is valid (i.e., exists in the system), then:\n\t* Identify the corresponding reason type by querying the database using the given ID.\n\tOtherwise, \n3. **Error Handling**: Inform the requesting party that the ID is invalid or not found.\n\nBy mapping this process to the business context:\n\n- The request represents a query (read) for an encouragement reason.\n- Validating the ID ensures the requested reason exists in the system before proceeding.\n- If the ID is invalid, the process terminates with an error message, effectively rejecting the request."
  ],
  "addOrUpdateEncouragementByEncouragementSpecialist / if (dto.getEncouragementDraft().equals(DraftEnum.Sent.getCode()))": [
    "Here\u0027s a clear business process description based on the provided Java method explanation:\n\n**Process: Registering an Encouragement**\n\nThe goal of this process is to register a new encouragement or update an existing one. The process begins when an employee (or \"registrant\") submits an encouragement draft.\n\n1. **Submission**: An employee submits an encouragement draft, which includes the motivation behind the encouragement.\n2. If the encouragement is valid and meets all requirements, then:\n\t* The system creates a new encouragement record in the database (register).\n\t* The encouragement is assigned a unique identifier for tracking purposes.\n3. Otherwise, if the encouragement does not meet all requirements or lacks sufficient detail, then:\n\t* The registrant will receive feedback indicating what changes are needed to improve the encouragement.\n4. Once the encouragement has been registered or updated, it undergoes a review process by the designated registrar.\n\n**Review Process**: The registrar reviews the submitted encouragement and determines whether to approve or reject it based on the following criteria:\n\n1. If the encouragement meets all necessary standards, then:\n\t* The registrar approves the encouragement and updates its status accordingly.\n2. Otherwise, if the encouragement does not meet the required standards, then:\n\t* The registrar rejects the encouragement and provides feedback indicating what changes are needed to improve it.\n\n**Notable Aspects**: Throughout this process, the system tracks the current user\u0027s role (currentUserRole) to ensure that only authorized employees can perform specific actions. Additionally, the finalReasonType is used to capture any reasoning or justification for rejecting an encouragement if necessary.\n\nBy following this process, organizations can efficiently register and manage encouragements while ensuring that they meet required standards and are reviewed by the designated registrar."
  ],
  "changeEncouragementStatus / if (status !\u003d null \u0026\u0026 (status.equals(EncouragementResultEnum.APPROVED.getCode()) || status.equals(EncouragementResultEnum.REJECTED.getCode()) || status.equals(EncouragementResultEnum.CORRECTION_AND_APPROVAL.getCode())))": [
    "Here\u0027s a clear business process description:\n\n**Process: Registering an Encouragement**\n\nThe purpose of this process is to record the registration of an encouragement, which will be reviewed by stakeholders. This process captures the moment when an encouragement is formally applied.\n\n**Flow:**\n\n1. **Trigger:** A new encouragement is identified and deemed suitable for application.\n2. If the encouragement meets the necessary criteria (e.g., approval from relevant authorities), then:\n\t* The registration of the encouragement is initiated, recording the date it was applied.\n3. Otherwise, if the encouragement does not meet the necessary criteria or requires further review, then:\n\t* A query is generated to clarify any outstanding issues or seek additional information.\n\n**Key Actions:**\n\n1. Register an encouragement with a timestamp indicating when the application occurred.\n2. Review and evaluate the encouragement against established criteria.\n\nThis process ensures that all encouragements are formally recorded and tracked, allowing for easy querying and review of their status over time."
  ],
  "changeEncouragementStatus / if (status !\u003d null \u0026\u0026 (status.equals(EncouragementResultEnum.SENT_FOR_CORRECTION.getCode())))": [
    "Here is a clear business process description based on the Java method:\n\n**Process:** Handling Encouragement Visibility Status\n\n**Step 1: Initial Status**\nThe encouragement visibility status is set to \"Not Seen\" initially.\n\n**Step 2: Review/Query Encouragement**\nAn employee reviews or queries an existing encouragement, triggering this process.\n\n**If**: The encouragement has not been seen by the employee,\n**Then**: Set the encouragement visibility status to \"Not Seen\".\n\n**Otherwise**: (The encouragement has already been seen)\nNo action is taken, as the status remains unchanged at \"Seen\".\n\n**Summary**: This process ensures that an encouragement\u0027s visibility status reflects its current state for an employee."
  ]
}